<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" dir="ltr" lang="en">
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" />
	<meta name="keywords" content="system, 10.39, leczenia, items, wiele, redbot, rozmowy, tibii, 1.1.7, download, monster, potionów, cavebot, zaawansowany, informacji, ekranie, check, pozwala, screen, skryptów, 1.3.6, advanced, mo&amp;380na, spells, szczegó&amp;322owo, character, mo&amp;380liwo&amp;347ci, clicks, tools, jakie, attacking, player, hp/mp/cap/others, powsta&amp;322, healer, crack, zdobytych, czasie, nied&amp;322ugim, zsta&amp;322, si&amp;281, najcz&amp;281&amp;347ciej, jednym, który, znowu, http://i58.tinypic.com/29yi6f9.png, forum, http://i62.tinypic.com/r89klg.png, http://speedy.sh/jddwe/ibot.exe, http://i41.tinypic.com/6tof1k.jpg" />
	<meta name="description" content="iBot 1.1.7 (dla Tibii 10.39) 
 
 
 
 
 
 
 
iBot powsta&#322; na bazie do&#347;wiadcze&#324; zdobytych przy tworzeniu botów takich jak np. kultowy TibiaBot NG. Z przekonaniem mo&#380;na stwierdzi&#263;, 
 i&#380; stabilno&#347;ci&#261; i funckjonalno&#347;ci&#261; iBot obecnie jest numerem jeden. Oto unikalne mo&#380;liwo&#347;ci jakie przedstawia autor programu:" />
	
	<title> iBot 1.1.7 (dla Tibii 10.39) TIBIA 10.39 DOWNLOAD!! + RED BOT 10.39 + CRACK [Archive]  - Blackdtools Tibia Forum</title>
	<link rel="stylesheet" type="text/css" href="../archive.css" />
</head>
<body>
<div class="pagebody">
<div id="navbar"><a href="../index.php%3Fpda=1.html">Blackdtools Tibia Forum</a> &gt; <a href="f-9.html">Blackd Proxy</a> &gt; <a href="f-10.html">Blackd Proxy General Chat</a> &gt;  iBot 1.1.7 (dla Tibii 10.39) TIBIA 10.39 DOWNLOAD!! + RED BOT 10.39 + CRACK</div>
<hr />
<div class="pda"><a href="t-61611.html%3Flogin=1.html" rel="nofollow">Log in</a></div>
<p class="largefont">View Full Version : <a href="https://www.blackdtools.net/showthread.php?61611-iBot-1-1-7-(dla-Tibii-10-39)-TIBIA-10-39-DOWNLOAD!!-RED-BOT-10-39-CRACK">iBot 1.1.7 (dla Tibii 10.39) TIBIA 10.39 DOWNLOAD!! + RED BOT 10.39 + CRACK</a></p>
<hr />
<div class="floatcontainer"></div><br />
<div class="post"><div class="posttop"><div class="username">vpv</div><div class="date">04-29-2014, 12:21</div></div><div class="posttext">iBot 1.1.7 (dla Tibii 10.39)<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
iBot powsta&#322; na bazie do&#347;wiadcze&#324; zdobytych przy tworzeniu botów takich jak np. kultowy TibiaBot NG. Z przekonaniem mo&#380;na stwierdzi&#263;,<br />
 i&#380; stabilno&#347;ci&#261; i funckjonalno&#347;ci&#261; iBot obecnie jest numerem jeden. Oto unikalne mo&#380;liwo&#347;ci jakie przedstawia autor programu:<br />
<br />
    Prostota obs&#322;ugi - iBot zosta&#322; zbudowany tak, aby po wpsianiu zaledwie kilku liter lub naci&#347;ni&#281;ciu jednego klawisza wykonywa&#322; kilka zaawansowanych funckji<br />
    System alarmowy - pozwala widzie&#263; na ekranie jednocze&#347;nie wiele ostrze&#380;e&#324;, informacji i statystyk<br />
    Zaawansowany system leczenia - Pozwala leczy&#263; za pomoc&#261; run, potionów i czarów. Program sam dobiera odpowiedni&#261; metod&#281; leczenia w zale&#380;no&#347;ci od procentowej utraty HP<br />
    System leczenia przyjació&#322; - pomaga uelcza&#263; wcze&#347;niej zdefiniowane osoby<br />
    System skryptów - bardzo rozbudowana baza skryptów, dzi&#281;ki której mo&#380;na zastosowa&#263; dan&#261; akcje w szczegó&#322;owo okre&#347;lonych warunkach.<br />
    Praktyczne informacje - wyswietlanie na ekranie przydatnych informacji na temat gry, graczy, potworów itp.<br />
    Zawansowany system leczenia i odnawiania many - równiez z mo&#380;liwo&#347;ci&#261; uleczania innego gracza<br />
    Zaawansowany Cavebot - chodzenie po pi&#281;trach, po drabinkach, odkopywanie dziur, otwieranie/zamykanie drzwi, przechodzenie przez teleporty itp.<br />
    Auto Rozmowy - Rozmowy z innymi graczami, rozmowy z NPC, automatyczne kupowanie run, potionów, deponowanie z&#322;ota<br />
    Zbieranie przedmiotów - szczegó&#322;owo okre&#347;laj jakie przedmioty chcesz zbiera&#263; lub ustawiaj limit zbieranych rzeczy<br />
    wiele innych ciekawych mo&#380;liwo&#347;ci, opisanych w poradnikach na forum<br />
<br />
<br />
<br />
http://i58.tinypic.com/29yi6f9.png<br />
<br />
<br />
<br />
http://i62.tinypic.com/r89klg.png<br />
<br />
<br />
<br />
Download:<br />
iBot 1.1.7 (http://speedy.sh/jddWE/iBot.exe)<br />
<br />
<br />
http://i41.tinypic.com/6tof1k.jpg<br />
__________________________________________________ __________________________________________________ _____________________<br />
<br />
<br />
RedBot 1.3.6 (dla Tibii 10.39)<br />
<br />
<br />
<br />
<br />
<br />
<br />
I znowu bot, który w nied&#322;ugim czasie zsta&#322; si&#281; jednym z najcz&#281;&#347;ciej u&#380;ywanych pomocy do Tibi. Czytaj&#261;c wiele opinni i komentarzy nie mamy w&#261;tpliwo&#347;ci - RedBot jest ca&#322;kowicie niewykrywalny.<br />
<br />
    Alarms: Check if you have a player on your screen, if someone is attacking you, if your HP/MP/Cap/Others are low, everything with 2 clicks!<br />
<br />
    Advanced Healer: Use Spells, Potions, Runes based in your character Health or Mana, exactly or percentage values.<br />
<br />
    Tools: Auto-Spells, Hunt Tools, Anti-Idle, Auto-Fishing, Sio Friend, others.<br />
<br />
    Cavebot: Hunt wherever you want to, buy/sell items from NPC's, deposit items in your depot and more, 100% afk!<br />
<br />
    Targeting: Use a specific attack mode, what spells you want to use in that monster, hunt running from them or reaching them!<br />
<br />
    Looting: Pickup only the loots that you want to, to the specified backpack, automatic items ID's!<br />
<br />
    Advanced Trainer: You can choose to train with Slimes, Monks, Players or any other monster with a few clicks!<br />
<br />
    HUD: Check the basic informations of your hunt and your character directly in your screen!<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
http://i57.tinypic.com/6fv7uh.png<br />
<br />
<br />
<br />
Download:<br />
RedBot 1.3.6 (http://speedy.sh/abbdG/RedbotPro139.exe)</div></div><hr />


<div id="copyright">Powered by vBulletin&reg; Version 4.2.5 Copyright &copy; 2021 vBulletin Solutions Inc. All rights reserved.</div>
</div>
</body>
</html>