<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" dir="ltr" lang="en">
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" />
	<meta name="keywords" content="system, si&amp;281, mo&amp;380na, event, serwerze, które, przez, naszym, s&amp;261, punktów, kilka, zdoby&amp;263, punkty, premium, wiele, innych, ka&amp;380dy, vestia.pl, osoba, przedmioty, graczy, serwer, znale&amp;378&amp;263, vestia, b&amp;281dzie, mog&amp;261, przedmiot, staramy, mo&amp;380e, ni&amp;380, gracz, forum, tutaj, mi&amp;281dzy, bie&amp;380&amp;261co, ró&amp;380nych, te&amp;380, by&amp;263, ponad, shopu, ju&amp;380, eventy, wszystkie, kilku, innymi, dzi&amp;281ki, ponadto, zaoferowa&amp;263, account, godziny" />
	<meta name="description" content="http://vestia.pl/images/vestia/logo.png 
 
	S&#322;owem wst&#281;pu... 
	Ju&#380; od pewnego czasu kr&#261;&#380;y&#322;y s&#322;uchy, &#380;e Vestia powróci. Teraz oficjalnie og&#322;aszamy t&#261; informacj&#281;!  
	Za nami pierwsza, najistotniejsza zmiana, nowym w&#322;a&#347;cicielem jest . Oczywi&#347;cie wszystko inne pozostaje po staremu, a zgodnie z zapewnieniami na bie&#380;&#261;co b&#281;dziemy dodawa&#263; nowo&#347;ci wymy&#347;lone jeszcze przez Cryptona. Post&#281;p naszych prac mo&#380;na obserwowa&#263; w RoadMapie. 
Crypton zosta&#322; zdegradowany do helpera i s&#322;u&#380;y rad&#261; xD 
 
	1. Informacje" />
	
	<title> Vestia.pl START 7 APRIL! [Archive]  - Blackdtools Tibia Forum</title>
	<link rel="stylesheet" type="text/css" href="../archive.css" />
</head>
<body>
<div class="pagebody">
<div id="navbar"><a href="../index.php%3Fpda=1.html">Blackdtools Tibia Forum</a> &gt; <a href="f-4.html">General</a> &gt; <a href="f-95.html">OT servers</a> &gt;  Vestia.pl START 7 APRIL!</div>
<hr />
<div class="pda"><a href="t-63117.html%3Flogin=1.html" rel="nofollow">Log in</a></div>
<p class="largefont">View Full Version : <a href="https://www.blackdtools.net/showthread.php?63117-Vestia-pl-START-7-APRIL!">Vestia.pl START 7 APRIL!</a></p>
<hr />
<div class="floatcontainer"></div><br />
<div class="post"><div class="posttop"><div class="username">vestia</div><div class="date">04-05-2017, 14:06</div></div><div class="posttext">http://vestia.pl/images/vestia/logo.png<br />
<br />
	S&#322;owem wst&#281;pu...<br />
	Ju&#380; od pewnego czasu kr&#261;&#380;y&#322;y s&#322;uchy, &#380;e Vestia powróci. Teraz oficjalnie og&#322;aszamy t&#261; informacj&#281;! <br />
	Za nami pierwsza, najistotniejsza zmiana, nowym w&#322;a&#347;cicielem jest . Oczywi&#347;cie wszystko inne pozostaje po staremu, a zgodnie z zapewnieniami na bie&#380;&#261;co b&#281;dziemy dodawa&#263; nowo&#347;ci wymy&#347;lone jeszcze przez Cryptona. Post&#281;p naszych prac mo&#380;na obserwowa&#263; w RoadMapie (https://trello.com/b/m4vtSUdt/vestiaot-roadmap).<br />
Crypton zosta&#322; zdegradowany do helpera i s&#322;u&#380;y rad&#261; xD<br />
<br />
	1. Informacje Ogólne<br />
	<br />
	IP: Vestia.pl (http://vestia.pl/)<br />
<br />
	Start: 7kwietnia 18:00<br />
	<br />
	<br />
		 IP: Vestia.pl<br />
		 PvP: od 250 lvla<br />
		 Domki: 600 lvl<br />
		 Stamina: tak<br />
		 Darmowy VIP do 250 lvla!<br />
		 Fragi do RSa: 25 na dzie&#324; / 100 na tydzie&#324; / 350 na miesi&#261;c<br />
		 Fragi do BSa: trzykrotno&#347;&#263; fragów do RSa<br />
		 Skille: x12 (x24 na trainerach)<br />
		 Magic level: x7 (x14 na trainerach)<br />
		 Exp stages:<br />
		1-50 - x400<br />
		51-150 - x250<br />
		151-200 - x200<br />
		201-350 - x100<br />
		351-500 - x60<br />
		501-750 - x25<br />
		751-1000 - x10<br />
		1001-1800 - x4<br />
		1801-2300 - x2<br />
		2301+ - x1<br />
	<br />
	2. Darmowe punkty<br />
	Jak zawsze na naszym serwerze nie przewidujemy punktów na gildi&#281;. Uwa&#380;amy, &#380;e takie co&#347; jest nieuczciwe w stosunku do innych graczy.<br />
	<br />
	Darmowe punkty lub przedmioty b&#281;dzie mo&#380;na zdoby&#263; na kilka innych sposobów:<br />
	<br />
		 Pierwsze 250 za&#322;o&#380;onych kont otrzyma po 12 punktów premium<br />
		 Dwie godziny po starcie serwera ka&#380;dy zalogowany gracz z poziomem wi&#281;kszym ni&#380; 300 dostanie 6 punktów premium<br />
		 Na naszym FanPage (https://www.facebook.com/VestiaOT/) pojawi si&#281; konkurs<br />
		 Przez pierwsze 24 godziny od startu loteria b&#281;dzie odbywa&#263; si&#281; co 10 minut<br />
	<br />
<br />
	3. Czym jest Vestia?<br />
	Tego serwera raczej nie trzeba nikomu przedstawia&#263;. Vestia jest najpopularniejszym i najbardziej rozbudowanym serwerem 4fun w Polsce. <br />
	<br />
	Sam serwer ma ju&#380; ponad 5 lat i jest aktualizowany &#347;rednio co kilka dni. Stawiamy na nim na cz&#281;ste aktualizacje i na do&#347;&#263; d&#322;ug&#261; w porównaniu z innymi serwerami gr&#281;.<br />
	<br />
	<br />
	4. Co nowego?<br />
	W czasie przed otwarciem nowej edycji skupimy si&#281; na optymalizacji servera oraz dodaniu kilku nowo&#347;ci. Zapraszamy do sugerowania zmian oraz wypowiadania si&#281; na forum, które ruszy ju&#380; niebawem!<br />
	Wi&#281;cej informacji o nowo&#347;ciach i rzeczach nad którymi pracujemy mo&#380;na znale&#378;&#263; w naszym ]roadmapie (https://trello.com/b/m4vtSUdt/vestiaot-roadmap).<br />
<br />
	5. Co mo&#380;emy zaoferowa&#263;?<br />
<br />
	-&gt; Cz&#281;ste aktualizacje!<br />
	Serwer jest aktualizowany na bie&#380;&#261;co, nie wierzysz? Sprawd&#378; tutaj (http://vestia.pl/archive/updates)!<br />
	Wszystkie zmiany na serwerze s&#261; opisywane, a oprócz tego na bie&#380;&#261;co poprawiamy wszystkie b&#322;&#281;dy zg&#322;aszane przez graczy.<br />
	<br />
<br />
	-&gt; Dba&#322;o&#347;&#263; o szczegó&#322;y<br />
	Znalaz&#322;e&#347; literówk&#281; lub b&#322;&#261;d na mapie? Co&#347; ci&#281; irytuje? Wystarczy zg&#322;osi&#263; to administracji, przyk&#322;adamy uwag&#281; do ka&#380;dego szczegó&#322;u.<br />
	<br />
<br />
	-&gt; Serwer TeamSpeak 3<br />
	Vestia posiada w&#322;asny serwer TS3 (IP: Vestia.pl), ka&#380;da osoba, która gra na serwerze mo&#380;e otrzyma&#263; na nim kana&#322; - wystarczy napisa&#263; na CTRL + R!<br />
	<br />
	<br />
	-&gt; Rozbudowany account maker<br />
	Nasz account maker zosta&#322; napisany ca&#322;kowicie od nowa, dzi&#281;ki czemu jest on zabezpieczony przed atakami na konta oraz udost&#281;pnia wiele ciekawych funkcjonalno&#347;ci.<br />
	<br />
	<br />
	-&gt; Aktywne forum dyskusyjne<br />
	Mo&#380;emy zaoferowa&#263; rozbudowane forum dyskusyjne z wieloma poradnikami i dzia&#322;ami. Ponadto dzi&#281;ki aktywnej spo&#322;eczno&#347;ci mo&#380;na tutaj z &#322;atwo&#347;ci&#261; uzyska&#263; pomoc na tematy zwi&#261;zane z serwerem.<br />
	<br />
	<br />
	-&gt; Ponad 200 nowych potworków<br />
	S&#261; to zarówno potwory questowe, potwory zwi&#261;zane z taskami, bossy, jak i te do expienia. Ka&#380;dy z nich posiada unikalny zestaw ataków i loot, staramy si&#281;, aby by&#322;y one unikalne i ciekawie zaprojektowane.<br />
	<br />
	<br />
	-&gt; Nie tylko item shop<br />
	Nie chcemy zmusza&#263; nikogo, aby kupowa&#322; w naszym item shopie, przedmioty z niego mo&#380;na zdoby&#263; na wiele sposobów. Mi&#281;dzy innymi z questów, poprzez wygrywanie eventów, wymian&#281; z graczami, czy te&#380; z ró&#380;nych systemów.<br />
	Ponadto na serwerze jest wiele przedmiotów, które s&#261; lepsze od tych z item shopu i mo&#380;na je zdoby&#263; tylko w grze.<br />
<br />
	6. Systemy? Pewnie!<br />
	<br />
	-&gt; System instancji<br />
	Jako jedyni dysponujemy ca&#322;kowicie unikalnych i innowacyjnym systemem instancji. <br />
	Jest to system odpowiadaj&#261;cy za generowanie losowych lochów, które mog&#261; by&#263; eksplorowane przez graczy. <br />
	Na &#347;mia&#322;ków, którzy si&#281; tam odwa&#380;&#261; zapu&#347;ci&#263; czekaj&#261; zarówna s&#322;awa, nagrody jak i wiele niebezpiecznych stworów i pu&#322;apek.<br />
	<br />
	<br />
	-&gt; System osi&#261;gni&#281;&#263;<br />
	Na naszym serwerze mo&#380;na znale&#378;&#263; rozbudowany system osi&#261;gni&#281;&#263;. Na chwil&#281; obecn&#261; jest ich ponad 80, a ich liczba ci&#261;gle ro&#347;nie.<br />
	<br />
	<br />
	-&gt; Market System<br />
	Wprowadzili&#347;my system dzia&#322;aj&#261;cy podobnie do market systemu na RL tibii. Dzi&#281;ki niemu za pomoc&#261; odpowiedniej komendy mo&#380;na wystawi&#263; przedmiot za punkty premium, który pó&#378;niej b&#281;dzie móg&#322; kupi&#263; kto&#347; inny przez stron&#281;.<br />
	System ten znacznie u&#322;atwia handel przedmiotami mi&#281;dzy graczami.<br />
	<br />
<br />
	-&gt; Survival Areny<br />
	Na serwerze znajduje si&#281; unikalny system aren survivalu. S&#261; to specjalne areny na które mo&#380;na wej&#347;&#263; raz dziennie i sprawdzi&#263; swoje umiej&#281;tno&#347;ci w walce przeciw ró&#380;nym potworom. <br />
	W miar&#281; ich zabijania ich si&#322;a si&#281; zwi&#281;ksza. Osoby, które wytrzymaj&#261; najd&#322;u&#380;ej nagradzane s&#261; exp tokenami pozwalaj&#261;cymi wej&#347;&#263; na specjalne expowiska.<br />
	<br />
	<br />
	-&gt; System promocji w item shopie<br />
	Codziennie jeden losowy przedmiot z Item Shopu jest przeceniany, przez co kosztuje 25% mniej ni&#380; normalnie.<br />
	<br />
	<br />
	-&gt; System poleconych<br />
	Ka&#380;dy zarejestrowany gracz dostaje specjalnego linka, którego mo&#380;e poda&#263; innej osobie. Je&#347;li ta osoba zarejestruje si&#281; z tego linka i do&#322;aduje punkty premium, gracz, który j&#261; poleci&#322; otrzyma dodatkowo 20% ilo&#347;ci punktów, które ta osoba zakupi&#322;a.<br />
	<br />
	<br />
	-&gt; System handlu postaciami<br />
	Na naszym serwerze znajdziecie system handlu postaciami. Chcesz sprzeda&#263; swoj&#261; posta&#263; i zdoby&#263; kilka punktów premium? Wystaw posta&#263;!<br />
	<br />
	<br />
	-&gt; Codzienne najazdy bossów<br />
	Codziennie o godzinie 21:30 na specjaln&#261; wysp&#281; ma miejsce najazd jednego z kilku losowych bossów. Ka&#380;dy z graczy mo&#380;e spróbowa&#263; stawi&#263; im czo&#322;a i zdoby&#263; unikalne przedmioty!<br />
	<br />
	<br />
	-&gt; System si&#322;y potworów<br />
	Na swojej drodze nigdy nie spotkasz takiego samego potworka, jedne mog&#261; by&#263; s&#322;absze a&#380; o 15%, a drugie o tyle silniejsze.<br />
	Ponadto je&#347;li b&#281;dziesz mia&#322; szcz&#281;&#347;cie, spotkasz silnego lub epickiego potwora. Takie stworzenia maj&#261; znacznie zwi&#281;kszon&#261; ilo&#347;&#263; &#380;ycia i si&#322;&#281; ataku w porównaniu do ich zwyk&#322;ych odpowiedników.<br />
	<br />
	<br />
	-&gt; Task system<br />
	Na Vestii znajdziecie troch&#281; inny system tasków ni&#380; to ma miejsce na innych serwerach. Za zabijanie okre&#347;lonych potworków zdobywa si&#281; punkty, które mo&#380;na pó&#378;niej wymieni&#263; na ró&#380;ne bonusy. S&#261; to mi&#281;dzy innymi: poziomy, przedmioty, addony, czy te&#380; ró&#380;nego rodzaju teleporty.<br />
	<br />
	<br />
	7. Eventy<br />
	Na naszym serwerze znajdziesz kilka ró&#380;nych i ciekawych eventów, niektóre z nich mog&#261; by&#263; znane z innych serwerów, jednak aktualnie staramy si&#281; wprowadza&#263; oryginalne eventy, których nigdzie indziej nie mo&#380;na znale&#378;&#263;.<br />
	<br />
<br />
	-&gt; Frozen Fortress Event<br />
	Czy jeste&#347; gotów podj&#261;&#263; codzienne wyzwanie i przedrze&#263; si&#281; przez hord&#281; potworów w celu ochrony zamku i zdobycia kilku poziomów? Wejd&#378; i przekonaj si&#281;.<br />
	<br />
	<br />
	-&gt; Burning Man Event<br />
	-&gt; Tron Event<br />
	-&gt; Swim Event<br />
	-&gt; PvP Event - Team Deathmatch<br />
	-&gt; PvP Event - Capture the Flag<br />
	-&gt; Run Event<br />
	-&gt; Zombie Event<br />
	-&gt; Temple of Darkness<br />
	-&gt; Firestorm Event<br />
	-&gt; Loteria - co godzin&#281; losowa zalogowana osoba dostaje jeden przedmiot z item shopu<br />
	<br />
	Szczegó&#322;owe informacje o eventach mo&#380;na znale&#378;&#263; tutaj - eventy (http://vestia.pl/library/events).<br />
<br />
	8. Mapa i zadania<br />
<br />
	-&gt; Dopracowana mapa<br />
	Na naszej mapie praktycznie nie znajdziesz kwadratowych expowisk, czy te&#380; questów. Przyk&#322;adamy  bardzo du&#380;e znaczenie do detali, staramy si&#281;, aby wszystkie mapki, które dodajemy by&#322;y dopracowane i ciekawie wykonane.<br />
	<br />
<br />
	<br />
	<br />
	9. Inne<br />
	-&gt; Nagrody za zdobywanie poziomów<br />
	-&gt; Nowe czary dla ka&#380;dej profesji<br />
	-&gt; Kilka ró&#380;nych aren PvP, w&#322;asne jak i miasta z RL mapy<br />
	-&gt; System ulepszania przedmiotów<br />
	-&gt; System punktów rankingowych gildii<br />
	-&gt; Nieko&#324;cz&#261;ce si&#281; runy i potiony<br />
	I wiele wi&#281;cej!<br />
<br />
	10. Screeny<br />
http://vestia.pl/images/ss/1.jpg<br />
	<br />
	http://vestia.pl/images/ss/2.jpg<br />
	<br />
	http://vestia.pl/images/ss/10.jpg<br />
	<br />
	http://vestia.pl/images/ss/5.jpg<br />
	<br />
	http://vestia.pl/images/ss/14.jpg</div></div><hr />


<div id="copyright">Powered by vBulletin&reg; Version 4.2.5 Copyright &copy; 2021 vBulletin Solutions Inc. All rights reserved.</div>
</div>
</body>
</html>